<?php
return [
    'accepted' => 'ویژگی :باید پذیرفته شود.',
    'active_url' => 'ویژگی : URL معتبری نیست.',
    'after' => 'ویژگی : باید تاریخی بعد از :date باشد.',
    'after_or_equal' => 'ویژگی : باید تاریخ بعد یا برابر با :date باشد.',
    'alpha' => 'ویژگی : فقط باید دارای حروف باشد.',
    'alpha_dash' => 'ویژگی : فقط باید شامل حروف, اعداد, خط تیره و زیرخط باشد.',
    'alpha_num' => 'ویژگی : فقط باید دارای حروف و اعداد باشد.',
    'array' => 'ویژگی : باید یک آرایه باشد.',
    'before' => 'ویژگی : باید تاریخی قبل از :date باشد.',
    'before_or_equal' => 'ویژگی : باید تاریخ قبل یا برابر با :date باشد.',
    'بین' => [
        'numeric' => 'ویژگی : باید بین :min و :max باشد.',
        'file' => 'ویژگی : باید بین :min و :max کیلوبایت باشد.',
        'string' => 'ویژگی : باید بین :min و :max کاراکتر باشد.',
        'array' => 'ویژگی : باید بین موارد :min و :max باشد.',
    ],
    'boolean' => 'فیلد :ویژگی باید درست یا نادرست باشد.',
    'confirmed' => 'تأیید ویژگی : مطابقت ندارد.',
    'date' => 'ویژگی : تاریخ معتبری نیست.',
    'date_equals' => 'ویژگی : باید تاریخی برابر با :date باشد.',
    'date_format' => 'ویژگی :با قالب :format مطابقت ندارد.',
    'different' => 'ویژگی :و :دیگر باید متفاوت باشند.',
    'digits' => 'ویژگی : باید ارقام :digits باشد.',
    'digits_between' => 'ویژگی : باید بین :min و :max رقم باشد.',
    'dimensions' => 'ویژگی : دارای ابعاد تصویر نامعتبر است.',
    'distinct' => 'فیلد :attribute دارای یک مقدار تکراری است.',
    'email' => 'ویژگی : باید یک آدرس ایمیل معتبر باشد.',
    'ends_with' => 'ویژگی : باید به یکی از موارد زیر ختم شود: :values.',
    'exists' => 'ویژگی :انتخاب شده نامعتبر است.',
    'file' => 'ویژگی : باید یک فایل باشد.',
    'filled' => 'فیلد :ویژگی باید دارای یک مقدار باشد.',
    'gt' => [
        'numeric' => 'ویژگی : باید بزرگتر از :value باشد.',
        'file' => 'ویژگی : باید بزرگتر از :value کیلوبایت باشد.',
        'string' => 'ویژگی : باید بزرگتر از کاراکترهای :value باشد.',
        'array' => 'ویژگی : باید بیش از موارد :value داشته باشد.',
    ],
    'gte' => [
        'numeric' => 'ویژگی : باید بزرگتر یا مساوی :value باشد.',
        'file' => 'ویژگی : باید بزرگتر یا مساوی :value کیلوبایت باشد.',
        'string' => 'ویژگی : باید بزرگتر یا مساوی کاراکترهای :value باشد.',
        'array' => 'ویژگی : باید موارد :value یا بیشتر داشته باشد.',
    ],
    'image' => 'ویژگی : باید یک تصویر باشد.',
    'in' => 'ویژگی :انتخاب شده نامعتبر است.',
    'in_array' => 'فیلد :ویژگی در :other وجود ندارد.',
    'integer' => 'ویژگی : باید یک عدد صحیح باشد.',
    'ip' => 'ویژگی : باید یک آدرس IP معتبر باشد.',
    'ipv4' => 'ویژگی : باید یک آدرس IPv4 معتبر باشد.',
    'ipv6' => 'ویژگی : باید یک آدرس IPv6 معتبر باشد.',
    'json' => 'ویژگی : باید یک رشته JSON معتبر باشد.',
    'lt' => [
        'numeric' => 'ویژگی : باید کمتر از :value باشد.',
        'file' => 'ویژگی : باید کمتر از :value کیلوبایت باشد.',
        'string' => 'ویژگی : باید کمتر از کاراکترهای :value باشد.',
        'array' => 'ویژگی : باید کمتر از موارد :value داشته باشد.',
    ],
    'lte' => [
        'numeric' => 'ویژگی : باید کمتر یا مساوی :value باشد.',
        'file' => 'ویژگی : باید کمتر یا مساوی :value کیلوبایت باشد.',
        'string' => 'ویژگی : باید کمتر یا مساوی کاراکترهای :value باشد.',
        'array' => 'ویژگی : نباید بیش از آیتم های :value داشته باشد.',
    ],
    'حداکثر' => [
        'numeric' => 'ویژگی : نباید بزرگتر از :max باشد.',
        'file' => 'ویژگی : نباید بیشتر از :max کیلوبایت باشد.',
        'string' => 'ویژگی : نباید بیشتر از :max کاراکتر باشد.',
        'array' => 'ویژگی : نباید بیش از موارد :max داشته باشد.',
    ],
    'mimes' => 'ویژگی : باید فایلی از نوع: :values باشد.',
    'mimetypes' => 'ویژگی : باید فایلی از نوع: :values باشد.',
    'دقیقه' => [
        'numeric' => 'ویژگی : باید حداقل :min باشد.',
        'file' => 'ویژگی : باید حداقل :min کیلوبایت باشد.',
        'string' => 'ویژگی : باید حداقل کاراکتر :min باشد.',
        'array' => 'ویژگی : باید حداقل موارد :min داشته باشد.',
    ],
    'multiple_of' => 'ویژگی : باید مضرب :value باشد.',
    'not_in' => 'ویژگی :انتخاب شده نامعتبر است.',
    'not_regex' => 'قالب :attribute نامعتبر است.',
    'numeric' => 'ویژگی : باید یک عدد باشد.',
    'password' => 'رمز عبور نادرست است.',
    'present' => 'فیلد :ویژگی باید وجود داشته باشد.',
    'regex' => 'قالب :attribute نامعتبر است.',
    'required' => 'فیلد :ویژگی الزامی است.',
    'required_if' => 'فیلد :ویژگی لازم است',

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],
];
